read_verilog rtl/gshare_predictor.v
prep -top top_module
blackbox pht_mem
opt_clean
show -format png -prefix artifacts/gshare_schematic